blasius_laminar_github/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientPlanes
    {
        type            patch;
        nFaces          320;
        startFace       34900;
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       35220;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       35300;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35200;
        startFace       35500;
    }
)

// ************************************************************************* //
